#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.hobby-kube.module.dns.cloudflare_record.domain will be created
  + resource "cloudflare_record" "domain" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "qwyck-cloud.co.uk"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "A"
      + value       = (known after apply)
      + zone_id     = "5fb988819e0fc6aee641271fe95068c2"
    }

  # module.hobby-kube.module.dns.cloudflare_record.hosts[0] will be created
  + resource "cloudflare_record" "hosts" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "kube1"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "A"
      + value       = (known after apply)
      + zone_id     = "5fb988819e0fc6aee641271fe95068c2"
    }

  # module.hobby-kube.module.dns.cloudflare_record.hosts[1] will be created
  + resource "cloudflare_record" "hosts" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "kube2"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "A"
      + value       = (known after apply)
      + zone_id     = "5fb988819e0fc6aee641271fe95068c2"
    }

  # module.hobby-kube.module.dns.cloudflare_record.hosts[2] will be created
  + resource "cloudflare_record" "hosts" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "kube3"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "A"
      + value       = (known after apply)
      + zone_id     = "5fb988819e0fc6aee641271fe95068c2"
    }

  # module.hobby-kube.module.dns.cloudflare_record.wildcard will be created
  + resource "cloudflare_record" "wildcard" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "*"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "qwyck-cloud.co.uk"
      + zone_id     = "5fb988819e0fc6aee641271fe95068c2"
    }

  # module.hobby-kube.module.etcd.data.null_data_source.endpoints will be read during apply
  # (config refers to values not yet known)
 <= data "null_data_source" "endpoints"  {
      + has_computed_default = (known after apply)
      + id                   = (known after apply)
      + inputs               = {
          + "list" = "http://10.0.1.1:2379,http://10.0.1.2:2379,http://10.0.1.3:2379"
        }
      + outputs              = (known after apply)
      + random               = (known after apply)
    }

  # module.hobby-kube.module.etcd.data.template_file.etcd-service[0] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "etcd-service"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            [Unit]
            Description=etcd
            After=network.target ${vpn_unit}
            
            [Service]
            Type=notify
            ExecStart=/opt/etcd/etcd --name ${hostname} \
              --data-dir /var/lib/etcd \
              --listen-client-urls "${listen_client_urls},http://localhost:2379" \
              --advertise-client-urls "${advertise_client_urls}" \
              --listen-peer-urls "${listen_peer_urls}" \
              --initial-cluster "${intial_cluster}" \
              --initial-advertise-peer-urls "${listen_peer_urls}" \
              --heartbeat-interval 200 \
              --election-timeout 5000
            Restart=always
            RestartSec=5
            TimeoutStartSec=0
            StartLimitInterval=0
            
            [Install]
            WantedBy=multi-user.target
        EOT
      + vars     = {
          + "advertise_client_urls" = "http://10.0.1.1:2379"
          + "hostname"              = "kube1"
          + "intial_cluster"        = "kube1=http://10.0.1.1:2380,kube2=http://10.0.1.2:2380,kube3=http://10.0.1.3:2380"
          + "listen_client_urls"    = "http://10.0.1.1:2379"
          + "listen_peer_urls"      = "http://10.0.1.1:2380"
          + "vpn_unit"              = "wg-quick@wg0.service"
        }
    }

  # module.hobby-kube.module.etcd.data.template_file.etcd-service[1] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "etcd-service"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            [Unit]
            Description=etcd
            After=network.target ${vpn_unit}
            
            [Service]
            Type=notify
            ExecStart=/opt/etcd/etcd --name ${hostname} \
              --data-dir /var/lib/etcd \
              --listen-client-urls "${listen_client_urls},http://localhost:2379" \
              --advertise-client-urls "${advertise_client_urls}" \
              --listen-peer-urls "${listen_peer_urls}" \
              --initial-cluster "${intial_cluster}" \
              --initial-advertise-peer-urls "${listen_peer_urls}" \
              --heartbeat-interval 200 \
              --election-timeout 5000
            Restart=always
            RestartSec=5
            TimeoutStartSec=0
            StartLimitInterval=0
            
            [Install]
            WantedBy=multi-user.target
        EOT
      + vars     = {
          + "advertise_client_urls" = "http://10.0.1.2:2379"
          + "hostname"              = "kube2"
          + "intial_cluster"        = "kube1=http://10.0.1.1:2380,kube2=http://10.0.1.2:2380,kube3=http://10.0.1.3:2380"
          + "listen_client_urls"    = "http://10.0.1.2:2379"
          + "listen_peer_urls"      = "http://10.0.1.2:2380"
          + "vpn_unit"              = "wg-quick@wg0.service"
        }
    }

  # module.hobby-kube.module.etcd.data.template_file.etcd-service[2] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "etcd-service"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            [Unit]
            Description=etcd
            After=network.target ${vpn_unit}
            
            [Service]
            Type=notify
            ExecStart=/opt/etcd/etcd --name ${hostname} \
              --data-dir /var/lib/etcd \
              --listen-client-urls "${listen_client_urls},http://localhost:2379" \
              --advertise-client-urls "${advertise_client_urls}" \
              --listen-peer-urls "${listen_peer_urls}" \
              --initial-cluster "${intial_cluster}" \
              --initial-advertise-peer-urls "${listen_peer_urls}" \
              --heartbeat-interval 200 \
              --election-timeout 5000
            Restart=always
            RestartSec=5
            TimeoutStartSec=0
            StartLimitInterval=0
            
            [Install]
            WantedBy=multi-user.target
        EOT
      + vars     = {
          + "advertise_client_urls" = "http://10.0.1.3:2379"
          + "hostname"              = "kube3"
          + "intial_cluster"        = "kube1=http://10.0.1.1:2380,kube2=http://10.0.1.2:2380,kube3=http://10.0.1.3:2380"
          + "listen_client_urls"    = "http://10.0.1.3:2379"
          + "listen_peer_urls"      = "http://10.0.1.3:2380"
          + "vpn_unit"              = "wg-quick@wg0.service"
        }
    }

  # module.hobby-kube.module.etcd.null_resource.etcd[0] will be created
  + resource "null_resource" "etcd" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.hobby-kube.module.etcd.null_resource.etcd[1] will be created
  + resource "null_resource" "etcd" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.hobby-kube.module.etcd.null_resource.etcd[2] will be created
  + resource "null_resource" "etcd" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.hobby-kube.module.firewall.null_resource.firewall[0] will be created
  + resource "null_resource" "firewall" {
      + id       = (known after apply)
      + triggers = {
          + "template" = <<~EOT
                #!/bin/sh
                set -e
                
                ufw --force reset
                ufw allow ssh
                ufw allow in on eth0 to any port 51820 # vpn on private interface
                ufw allow in on wg0
                ufw allow in on weave # Kubernetes pod overlay interface
                ufw allow 6443 # Kubernetes API secure remote port
                ufw allow 80
                ufw allow 443
                ufw default deny incoming
                ufw --force enable
                ufw status verbose
            EOT
        }
    }

  # module.hobby-kube.module.firewall.null_resource.firewall[1] will be created
  + resource "null_resource" "firewall" {
      + id       = (known after apply)
      + triggers = {
          + "template" = <<~EOT
                #!/bin/sh
                set -e
                
                ufw --force reset
                ufw allow ssh
                ufw allow in on eth0 to any port 51820 # vpn on private interface
                ufw allow in on wg0
                ufw allow in on weave # Kubernetes pod overlay interface
                ufw allow 6443 # Kubernetes API secure remote port
                ufw allow 80
                ufw allow 443
                ufw default deny incoming
                ufw --force enable
                ufw status verbose
            EOT
        }
    }

  # module.hobby-kube.module.firewall.null_resource.firewall[2] will be created
  + resource "null_resource" "firewall" {
      + id       = (known after apply)
      + triggers = {
          + "template" = <<~EOT
                #!/bin/sh
                set -e
                
                ufw --force reset
                ufw allow ssh
                ufw allow in on eth0 to any port 51820 # vpn on private interface
                ufw allow in on wg0
                ufw allow in on weave # Kubernetes pod overlay interface
                ufw allow 6443 # Kubernetes API secure remote port
                ufw allow 80
                ufw allow 443
                ufw default deny incoming
                ufw --force enable
                ufw status verbose
            EOT
        }
    }

  # module.hobby-kube.module.kubernetes.data.template_file.master will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "master"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            #!/bin/sh
            set -e
            
            kubeadm init --config /tmp/master-configuration.yml \
              --ignore-preflight-errors=Swap,NumCPU
            
            kubeadm token create ${token}
            
            [ -d $HOME/.kube ] || mkdir -p $HOME/.kube
            ln -s /etc/kubernetes/admin.conf $HOME/.kube/config
            
            until nc -z localhost 6443; do
              echo "Waiting for API server to respond"
              sleep 5
            done
            
            kubectl apply -f "https://cloud.weave.works/k8s/net?k8s-version=$(kubectl version | base64 | tr -d '\n')"
            
            # See: https://kubernetes.io/docs/admin/authorization/rbac/
            kubectl create clusterrolebinding permissive-binding \
              --clusterrole=cluster-admin \
              --user=admin \
              --user=kubelet \
              --group=system:serviceaccounts
        EOT
      + vars     = {
          + "token" = (known after apply)
        }
    }

  # module.hobby-kube.module.kubernetes.data.template_file.master-configuration will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "master-configuration"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            apiVersion: kubeadm.k8s.io/v1beta1
            kind: InitConfiguration
            localAPIEndpoint:
              advertiseAddress: ${api_advertise_addresses}
              bindPort: 6443
            ---
            apiVersion: kubeadm.k8s.io/v1beta1
            kind: ClusterConfiguration
            certificatesDir: /etc/kubernetes/pki
            apiServer:
              certSANs:
              ${cert_sans}
            etcd:
              external:
                endpoints:
                ${etcd_endpoints}
            ---
            apiVersion: kubelet.config.k8s.io/v1beta1
            kind: KubeletConfiguration
            failSwapOn: false
        EOT
      + vars     = {
          + "api_advertise_addresses" = "10.0.1.1"
          + "cert_sans"               = (known after apply)
          + "etcd_endpoints"          = (known after apply)
        }
    }

  # module.hobby-kube.module.kubernetes.data.template_file.slave will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "slave"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            #!/bin/sh
            set -e
            
            until $(nc -z ${master_ip} 6443); do
              echo "Waiting for API server to respond"
              sleep 5
            done
            
            kubeadm join --token=${token} ${master_ip}:6443 \
              --discovery-token-unsafe-skip-ca-verification \
              --ignore-preflight-errors=Swap
        EOT
      + vars     = {
          + "master_ip" = "10.0.1.1"
          + "token"     = (known after apply)
        }
    }

  # module.hobby-kube.module.kubernetes.null_resource.kubectl will be created
  + resource "null_resource" "kubectl" {
      + id       = (known after apply)
      + triggers = {
          + "ip" = "10.0.1.1"
        }
    }

  # module.hobby-kube.module.kubernetes.null_resource.kubernetes[0] will be created
  + resource "null_resource" "kubernetes" {
      + id = (known after apply)
    }

  # module.hobby-kube.module.kubernetes.null_resource.kubernetes[1] will be created
  + resource "null_resource" "kubernetes" {
      + id = (known after apply)
    }

  # module.hobby-kube.module.kubernetes.null_resource.kubernetes[2] will be created
  + resource "null_resource" "kubernetes" {
      + id = (known after apply)
    }

  # module.hobby-kube.module.kubernetes.random_string.token1 will be created
  + resource "random_string" "token1" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.hobby-kube.module.kubernetes.random_string.token2 will be created
  + resource "random_string" "token2" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.hobby-kube.module.provider.hcloud_server.host[0] will be created
  + resource "hcloud_server" "host" {
      + backup_window = (known after apply)
      + backups       = false
      + datacenter    = (known after apply)
      + id            = (known after apply)
      + image         = "ubuntu-18.04"
      + ipv4_address  = (known after apply)
      + ipv6_address  = (known after apply)
      + ipv6_network  = (known after apply)
      + keep_disk     = false
      + location      = "nbg1"
      + name          = "kube1"
      + server_type   = "cx11"
      + ssh_keys      = [
          + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC4axeFdRYAXCX/KOJFW20srLLvGRmMCw0yJHbRLUuV3kXEYGyxPRjXhyVx5n4UBGPBNW4nAqoVeMCubzojvgFfagQRENM5E6NvKI2/wP+mETZRyWi3Aff2vXjbkd0Jpxnbo28KFrPNClaKR6BsrnnQsr36YhUUsSnyoeLms7QLpsmPSJFFs/X4g5OZqCDJ9Ey9WHP4AFFjD7t64yr/IDnfpXZpsmEX7HChhMSQKVxpteFMBDvJL55RfpurlyS/+AqEMLqgZ4pseY/+LnsnZaQQcOchuC8tXDzsGa7S7Mnc23udvODharvrVxKR3UWKArcdGEYked6XKkIHrzFACnugZV9ajp9M+urRS4C8B7h25bxOXs+ZdHAIcotfVwcxhnWoczhDXbSlML8RCmGefCKWFYIr5FFeS1ikkbYBNw1IrzpEX/uHFIhtfH0ubKiwnLHS21jn8tU773Dx3mNyxke9G/nSPfGq+4VBn3g5wNuwbxGEMa2jYgvi8UO0QOPf8fLqKwqeAZqJuZyyCnVkejk1UOYJ6yMhYmSjhFIoawAChhqQpAwjZaEqrslJx+d/y6U6sTGJLr0JgEC2mKNNXki7m/lV3QToCSCz87XDjmiAzA4yoXu28/mEuvfL+wtEqR9Nbf+Gm+EWo8ohy6hI22tLMfqYpkC/sDkMYPlg2Yy6AQ==",
        ]
      + status        = (known after apply)
    }

  # module.hobby-kube.module.provider.hcloud_server.host[1] will be created
  + resource "hcloud_server" "host" {
      + backup_window = (known after apply)
      + backups       = false
      + datacenter    = (known after apply)
      + id            = (known after apply)
      + image         = "ubuntu-18.04"
      + ipv4_address  = (known after apply)
      + ipv6_address  = (known after apply)
      + ipv6_network  = (known after apply)
      + keep_disk     = false
      + location      = "nbg1"
      + name          = "kube2"
      + server_type   = "cx11"
      + ssh_keys      = [
          + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC4axeFdRYAXCX/KOJFW20srLLvGRmMCw0yJHbRLUuV3kXEYGyxPRjXhyVx5n4UBGPBNW4nAqoVeMCubzojvgFfagQRENM5E6NvKI2/wP+mETZRyWi3Aff2vXjbkd0Jpxnbo28KFrPNClaKR6BsrnnQsr36YhUUsSnyoeLms7QLpsmPSJFFs/X4g5OZqCDJ9Ey9WHP4AFFjD7t64yr/IDnfpXZpsmEX7HChhMSQKVxpteFMBDvJL55RfpurlyS/+AqEMLqgZ4pseY/+LnsnZaQQcOchuC8tXDzsGa7S7Mnc23udvODharvrVxKR3UWKArcdGEYked6XKkIHrzFACnugZV9ajp9M+urRS4C8B7h25bxOXs+ZdHAIcotfVwcxhnWoczhDXbSlML8RCmGefCKWFYIr5FFeS1ikkbYBNw1IrzpEX/uHFIhtfH0ubKiwnLHS21jn8tU773Dx3mNyxke9G/nSPfGq+4VBn3g5wNuwbxGEMa2jYgvi8UO0QOPf8fLqKwqeAZqJuZyyCnVkejk1UOYJ6yMhYmSjhFIoawAChhqQpAwjZaEqrslJx+d/y6U6sTGJLr0JgEC2mKNNXki7m/lV3QToCSCz87XDjmiAzA4yoXu28/mEuvfL+wtEqR9Nbf+Gm+EWo8ohy6hI22tLMfqYpkC/sDkMYPlg2Yy6AQ==",
        ]
      + status        = (known after apply)
    }

  # module.hobby-kube.module.provider.hcloud_server.host[2] will be created
  + resource "hcloud_server" "host" {
      + backup_window = (known after apply)
      + backups       = false
      + datacenter    = (known after apply)
      + id            = (known after apply)
      + image         = "ubuntu-18.04"
      + ipv4_address  = (known after apply)
      + ipv6_address  = (known after apply)
      + ipv6_network  = (known after apply)
      + keep_disk     = false
      + location      = "nbg1"
      + name          = "kube3"
      + server_type   = "cx11"
      + ssh_keys      = [
          + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC4axeFdRYAXCX/KOJFW20srLLvGRmMCw0yJHbRLUuV3kXEYGyxPRjXhyVx5n4UBGPBNW4nAqoVeMCubzojvgFfagQRENM5E6NvKI2/wP+mETZRyWi3Aff2vXjbkd0Jpxnbo28KFrPNClaKR6BsrnnQsr36YhUUsSnyoeLms7QLpsmPSJFFs/X4g5OZqCDJ9Ey9WHP4AFFjD7t64yr/IDnfpXZpsmEX7HChhMSQKVxpteFMBDvJL55RfpurlyS/+AqEMLqgZ4pseY/+LnsnZaQQcOchuC8tXDzsGa7S7Mnc23udvODharvrVxKR3UWKArcdGEYked6XKkIHrzFACnugZV9ajp9M+urRS4C8B7h25bxOXs+ZdHAIcotfVwcxhnWoczhDXbSlML8RCmGefCKWFYIr5FFeS1ikkbYBNw1IrzpEX/uHFIhtfH0ubKiwnLHS21jn8tU773Dx3mNyxke9G/nSPfGq+4VBn3g5wNuwbxGEMa2jYgvi8UO0QOPf8fLqKwqeAZqJuZyyCnVkejk1UOYJ6yMhYmSjhFIoawAChhqQpAwjZaEqrslJx+d/y6U6sTGJLr0JgEC2mKNNXki7m/lV3QToCSCz87XDjmiAzA4yoXu28/mEuvfL+wtEqR9Nbf+Gm+EWo8ohy6hI22tLMfqYpkC/sDkMYPlg2Yy6AQ==",
        ]
      + status        = (known after apply)
    }

  # module.hobby-kube.module.swap.null_resource.swap[0] will be created
  + resource "null_resource" "swap" {
      + id = (known after apply)
    }

  # module.hobby-kube.module.swap.null_resource.swap[1] will be created
  + resource "null_resource" "swap" {
      + id = (known after apply)
    }

  # module.hobby-kube.module.swap.null_resource.swap[2] will be created
  + resource "null_resource" "swap" {
      + id = (known after apply)
    }

  # module.hobby-kube.module.wireguard.data.template_file.interface-conf[0] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "interface-conf"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            [Interface]
            Address = ${address}
            PrivateKey = ${private_key}
            ListenPort = ${port}
            
            ${peers}
        EOT
      + vars     = {
          + "address"     = "10.0.1.1"
          + "peers"       = (known after apply)
          + "port"        = "51820"
          + "private_key" = "oHvdR9HtjLOtUhSAweOAl+TQUkhjaw9u4JmWXwK3wnU="
        }
    }

  # module.hobby-kube.module.wireguard.data.template_file.interface-conf[1] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "interface-conf"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            [Interface]
            Address = ${address}
            PrivateKey = ${private_key}
            ListenPort = ${port}
            
            ${peers}
        EOT
      + vars     = {
          + "address"     = "10.0.1.2"
          + "peers"       = (known after apply)
          + "port"        = "51820"
          + "private_key" = "WMERpNy+JWhLnToS/y+O4KbUe3KjwQBT/ee9Zv4ywnM="
        }
    }

  # module.hobby-kube.module.wireguard.data.template_file.interface-conf[2] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "interface-conf"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            [Interface]
            Address = ${address}
            PrivateKey = ${private_key}
            ListenPort = ${port}
            
            ${peers}
        EOT
      + vars     = {
          + "address"     = "10.0.1.3"
          + "peers"       = (known after apply)
          + "port"        = "51820"
          + "private_key" = "6BiNYs0gkH8ZfS1JawPFiJVAOxCfUXj9nvtrPBQH6WE="
        }
    }

  # module.hobby-kube.module.wireguard.data.template_file.peer-conf[0] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "peer-conf"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            [Peer]
            PublicKey = ${public_key}
            AllowedIps = ${allowed_ips}
            Endpoint = ${endpoint}:${port}
        EOT
      + vars     = {
          + "allowed_ips" = "10.0.1.1/32"
          + "endpoint"    = (known after apply)
          + "port"        = "51820"
          + "public_key"  = "9Bh/CB+R+DbKt8zEdPdNkEY030G7RtWjEOji8g7ianQ="
        }
    }

  # module.hobby-kube.module.wireguard.data.template_file.peer-conf[1] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "peer-conf"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            [Peer]
            PublicKey = ${public_key}
            AllowedIps = ${allowed_ips}
            Endpoint = ${endpoint}:${port}
        EOT
      + vars     = {
          + "allowed_ips" = "10.0.1.2/32"
          + "endpoint"    = (known after apply)
          + "port"        = "51820"
          + "public_key"  = "F9glufJfKP2zr8As+GBx7X2srkDN0W8lyRAqACJDPR4="
        }
    }

  # module.hobby-kube.module.wireguard.data.template_file.peer-conf[2] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "peer-conf"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            [Peer]
            PublicKey = ${public_key}
            AllowedIps = ${allowed_ips}
            Endpoint = ${endpoint}:${port}
        EOT
      + vars     = {
          + "allowed_ips" = "10.0.1.3/32"
          + "endpoint"    = (known after apply)
          + "port"        = "51820"
          + "public_key"  = "toUJDK25lTpoJQJS7HNXV/uPzdaQVcUuQuIbG/GnXyI="
        }
    }

  # module.hobby-kube.module.wireguard.null_resource.wireguard[0] will be created
  + resource "null_resource" "wireguard" {
      + id       = (known after apply)
      + triggers = {
          + "count" = "3"
        }
    }

  # module.hobby-kube.module.wireguard.null_resource.wireguard[1] will be created
  + resource "null_resource" "wireguard" {
      + id       = (known after apply)
      + triggers = {
          + "count" = "3"
        }
    }

  # module.hobby-kube.module.wireguard.null_resource.wireguard[2] will be created
  + resource "null_resource" "wireguard" {
      + id       = (known after apply)
      + triggers = {
          + "count" = "3"
        }
    }

Plan: 26 to add, 0 to change, 0 to destroy.

Warning: Quoted type constraints are deprecated

  on .terraform/modules/hobby-kube/dns/cloudflare/main.tf line 14, in variable "hostnames":
  14:   type = "list"

Terraform 0.11 and earlier required type constraints to be given in quotes,
but that form is now deprecated and will be removed in a future version of
Terraform. To silence this warning, remove the quotes around "list" and write
list(string) instead to explicitly indicate that the list elements are
strings.

(and 26 more similar warnings elsewhere)


Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/hobby-kube/dns/cloudflare/main.tf line 22, in provider "cloudflare":
  22:   email     = "${var.email}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 33 more similar warnings elsewhere)


Warning: Quoted references are deprecated

  on .terraform/modules/hobby-kube/dns/cloudflare/main.tf line 53, in resource "cloudflare_record" "wildcard":
  53:   depends_on = ["cloudflare_record.domain"]

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

(and 4 more similar warnings elsewhere)

```

</details>

*Workflow: `build`, Action: `jrmcdonaldterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
